tutorials/compressible/DBNS/explicitDBNSSolver/2DRiemann800/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.5  -0.5 -0.01)
    ( 0.5  -0.5 -0.01)
    ( 0.5   0.5 -0.01)
    (-0.5   0.5 -0.01)
    (-0.5  -0.5  0.01)
    ( 0.5  -0.5  0.01)
    ( 0.5   0.5  0.01)
    (-0.5   0.5  0.01)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (800 800 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch sides 
    (
        (0 4 7 3)
        (1 2 6 5)
        (0 1 5 4)
        (3 7 6 2)
    )
    empty empty 
    (
        (5 6 7 4)
        (0 3 2 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
